# 1)კონსოლიდან შეიტანეთ ორი რიცხვი და დაბეჭდეთ ყველა არითმეტიკული ოპერაცია 
# (მიმატება, გამოკლება, გამრავლება, ჩვეულებრივი გაყოფა,
#  მთელზე გაყოფა, ნაშთის აღება, ახარისხება).

# x = int(input("Sheiyvanet pirveli ricxvi: "))
# y = int(input("Sheiyvanet meore ricxvi: "))

# print(x+y)
# print(x-y)
# print(x*y)
# print(x/y)
# print(x//y)
# print(x%y)
# print(x**y)

# 2) დაწერეთ პროგრამა რომბის ფართობის გამოსათვლელად.
#  მომხმარებელს კლავიატურის გამოყენებით შეაქვს ორი დიაგონალის სიგრძე.

# pirveli_diagonali = int(input("შეიყვანეთ პირველი დიაგონალის სიგრძე : "))
# meore_diagonali = int(input("შეიყვანეთ მეორე დიაგონალის სიგრძე: "))


# print(f"რომბის ფართობი არის : {pirveli_diagonali * meore_diagonali / 2}")

# 3) მომხმარებელის შეაქვს მეტრების რაოდენობა. დაბეჭდეთ შესაბამისი მნიშვნელობა
#  სანტიმეტრებში, დეციმეტრებში, მილიმეტრებში, მილში.

# metri = int(input("შეიყვანეთ მეტრების რაოდენობა: "))

# print(f"მეტრების რაოდენობა სანტიმეტრებში არის : {metri * 100}")
# print(f"მეტრების რაოდენობა დეციმეტრებში არის :  {metri * 10}")
# print(f"მეტრების რაოდენობა მილიმეტრებში არის : {metri * 1000}")
# print(f"მეტრების რაოდენობა მილში დაახლოებით არის : {metri * 0.0006}")

# 4) დაწერეთ პროგრამა, რომელიც ითვლის სამკუთხედის ფართობს. მომხმარებელს 
# კონსოლიდან შეყავს სამკუთხედის სიმაღლისა და ფუძის მნიშვნელობა.


# x = int(input("შეიყვანეთ სამკუთხედის სიმაღლე: "))
# y = int(input("შეიყვანეთ სამკუთხედის ფუძე: "))

# print(f"სამკუთხედის ფართობი არის : {x * y / 2}")

# 5) კონსოლიდან შეიტანეთ ორნიშნა რიცხვი და დაბეჭდეთ ციფრთა ჯამი.

# x = int(input("შეიყვანეთ ორნიშნა რიცხვი: "))

# print(f"ციფრთა ჯამი არის: {x // 10 + x % 10}")

